In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [4]:
df = pd.read_csv("dataset_group.csv")

In [5]:
df.head()

         Date  Order_id        Product
0  01-01-2018         1         yogurt
1  01-01-2018         1           pork
2  01-01-2018         1  sandwich bags
3  01-01-2018         1     lunch meat
4  01-01-2018         1   all- purpose

In [6]:
df.tail()

             Date  Order_id            Product
20636  25-02-2020      1138               soda
20637  25-02-2020      1138       paper towels
20638  26-02-2020      1139               soda
20639  26-02-2020      1139  laundry detergent
20640  26-02-2020      1139            shampoo

In [8]:
df.shape

(20641, 3)

In [9]:
df.isnull().sum()

Date        0
Order_id    0
Product     0
dtype: int64

In [13]:
df.duplicated().sum()

4730